{
  "knight": {
    "neuro_profiles": [
      "Your natural energy tends toward structure and protection - you're the type who values stability and commitment",
      "There's a reliability about you that comes from your neuro profile - people know they can count on you",
      "Your chemistry naturally leans toward creating secure foundations and lasting bonds",
      "You have a protector's instinct - building stable relationships is in your nature"
    ],
    "serotonin_variations": [
      "That warmth you bring to relationships? That's high serotonin making you naturally empathetic",
      "Your intuition about people is incredibly sharp because of your serotonin levels",
      "There's a natural safety you create - that's serotonin working its magic",
      "People feel secure around you because of your naturally high serotonin"
    ],
    "dopamine_variations": [
      "That drive you have? That's dopamine pushing you toward your goals",
      "Your ambition comes from healthy dopamine levels - you're naturally motivated",
      "The excitement you feel when pursuing something meaningful? That's dopamine",
      "You crave accomplishment because your dopamine needs that forward momentum"
    ],
    "blended_descriptions": [
      "Looking at your birth date, I can see your natural style tends toward planning and protecting. Your high serotonin levels mean you naturally focus on bonding and stability, while your moderate dopamine levels mean you also crave excitement and accomplishment.",
      "Your chemistry is interesting - you have this protective instinct from your neuro profile, but there's also this drive for adventure. High serotonin gives you emotional intelligence, while your dopamine keeps things exciting.",
      "What's fascinating about your profile is how you balance stability with ambition. Your serotonin makes you naturally good at reading people and creating safety, while your dopamine pushes you toward growth and achievement.",
      "You've got this unique combination - the reliability that comes from certain neuro traits mixed with the drive that comes from others. It makes you someone who can build something lasting while also keeping things interesting."
    ]
  },
  "warrior": {
    "neuro_profiles": [
      "Your energy is naturally intense and direct - you go after what you want",
      "There's a competitive edge to you that shows up in your relationship style",
      "Your neurochemistry is wired for action and pursuing what matters to you",
      "You have a hunter's instinct - you know how to go after what you want in relationships"
    ],
    "serotonin_variations": [
      "Despite your intensity, you have this capacity for deep emotional connection",
      "There's a warmth beneath your drive that comes from your serotonin",
      "Your intuition is sharper than most people realize",
      "People are surprised by how emotionally intelligent you can be when it matters"
    ],
    "dopamine_variations": [
      "That intensity you bring? That's high dopamine fueling your drive",
      "Your ambition is off the charts - dopamine makes you naturally goal-oriented",
      "You thrive on excitement and forward momentum",
      "The way you pursue what you want? That's pure dopamine energy"
    ],
    "blended_descriptions": [
      "Your birth date shows someone who's naturally driven and competitive. You have high dopamine giving you incredible drive and charisma, but your serotonin balances it out with real emotional depth when you let it.",
      "What stands out about your profile is how much energy and focus you bring. High dopamine makes you naturally ambitious and exciting to be around, while your serotonin gives you the ability to actually connect deeply when you choose to.",
      "You're wired for action and pursuit - that's clear from your neuro profile. Your dopamine is through the roof, making you naturally charismatic and driven, but your serotonin ensures you're not just chasing empty victories.",
      "There's a warrior energy to your chemistry - you go after what you want. High dopamine gives you that competitive edge and charisma, but don't underestimate your serotonin's ability to create genuine connection."
    ]
  },
  "mystic": {
    "neuro_profiles": [
      "Your energy naturally flows toward depth and meaning in relationships",
      "You're wired for spiritual and emotional connection",
      "Your neuro profile shows someone who values authentic, soulful connection",
      "There's a depth to you that naturally seeks meaningful relationships"
    ],
    "serotonin_variations": [
      "Your emotional intelligence is your superpower - that's high serotonin",
      "People feel understood by you in ways they rarely experience",
      "Your intuition about emotional needs is incredibly sharp",
      "That safety you create for others? That's serotonin at work"
    ],
    "dopamine_variations": [
      "You crave meaningful experiences, not just excitement",
      "Your dopamine seeks fulfillment in deeper ways",
      "There's a creative side to you that needs expression",
      "You're motivated by growth and transformation"
    ],
    "blended_descriptions": [
      "Looking at your birth date, I see someone deeply intuitive and emotionally intelligent. Your high serotonin gives you incredible emotional awareness and the ability to make others feel truly understood, while your moderate dopamine keeps you engaged with growth and transformation.",
      "Your chemistry is fascinating - you have this deep emotional intelligence from high serotonin that makes you naturally gifted at connection, combined with a drive for meaning and growth that comes from your dopamine.",
      "What's beautiful about your profile is how you combine emotional depth with authentic drive. Your serotonin makes you incredibly empathetic and intuitive, while your dopamine pushes you toward meaningful experiences and personal growth.",
      "You're wired for soulful connection - that's clear. Your serotonin gives you the emotional intelligence to understand people deeply, and your dopamine ensures you're not just sitting in reflection but actively pursuing meaningful growth."
    ]
  },
  "magician": {
    "neuro_profiles": [
      "Your energy is naturally transformative and visionary",
      "You see possibilities and connections others miss",
      "Your neuro profile shows someone who can inspire and change people",
      "There's a creative power to you that affects relationships"
    ],
    "serotonin_variations": [
      "Despite your visionary nature, you can create real emotional safety",
      "Your intuition about potential in people is remarkable",
      "You have this ability to make people believe in themselves",
      "Your serotonin gives you the emotional intelligence to back up your visions"
    ],
    "dopamine_variations": [
      "Your creativity is fueled by high dopamine",
      "You thrive on bringing new possibilities into reality",
      "That excitement when you see potential? That's dopamine",
      "You're naturally motivated by innovation and transformation"
    ],
    "blended_descriptions": [
      "Your birth date reveals someone with transformative energy and vision. High dopamine gives you incredible creativity and the ability to see possibilities, while your serotonin ensures you can actually connect and make those visions meaningful for others.",
      "What's unique about your profile is how you combine visionary thinking with emotional intelligence. Your dopamine fuels your creativity and drive, while your serotonin gives you the intuition to understand what people actually need.",
      "You're wired to inspire and transform - that's your gift. High dopamine makes you naturally creative and forward-thinking, while your serotonin ensures your transformations aren't just exciting but actually emotionally meaningful.",
      "There's a magician energy to your chemistry - you can see what others can't. Your dopamine gives you visionary creativity, but your serotonin ensures you're not just playing with ideas but actually creating real emotional impact."
    ]
  },
  "queen": {
    "neuro_profiles": [
      "Your energy naturally commands respect and creates harmony",
      "You're wired for leadership and elegant connection",
      "Your neuro profile shows someone who can inspire loyalty and devotion",
      "There's a regality to your relationship style - you deserve to be treated like royalty"
    ],
    "serotonin_variations": [
      "Your emotional intelligence is sophisticated and refined",
      "You create environments where people can flourish",
      "Your intuition about social dynamics is exceptional",
      "That grace under pressure? That's serotonin working beautifully"
    ],
    "dopamine_variations": [
      "You have high standards and the drive to maintain them",
      "Your ambition is expressed through creating beauty and harmony",
      "You thrive on elevating experiences and relationships",
      "That drive for excellence? That's dopamine in a refined form"
    ],
    "blended_descriptions": [
      "Looking at your birth date, I see someone with natural grace and leadership ability. Your serotonin gives you sophisticated emotional intelligence and the ability to create harmony, while your moderate dopamine gives you the drive to elevate everything you touch.",
      "Your chemistry is elegant - you have this natural ability to lead and inspire. High serotonin makes you emotionally intelligent and socially adept, while your dopamine ensures you're not just maintaining harmony but actively creating something beautiful.",
      "What stands out about your profile is how you combine emotional sophistication with refined ambition. Your serotonin gives you the grace and intuition to navigate relationships beautifully, while your dopamine pushes you toward excellence and creating something special.",
      "You're wired for leadership and elegance - that's clear. Your serotonin provides the emotional intelligence and social grace, while your dopamine gives you the refined drive to make relationships truly exceptional."
    ]
  },
  "huntress": {
    "neuro_profiles": [
      "Your energy is naturally independent and self-directed",
      "You know what you want and you're not afraid to go after it",
      "Your neuro profile shows someone who values freedom and authenticity",
      "There's a fierce independence to your relationship style"
    ],
    "serotonin_variations": [
      "Beneath your independence is a capacity for deep loyalty",
      "You're more emotionally intelligent than you let on",
      "Your intuition about when to trust is sharp",
      "That selective warmth you show? That's serotonin's gift"
    ],
    "dopamine_variations": [
      "Your independence is fueled by healthy dopamine",
      "You thrive on pursuing your own path",
      "That drive to break free from expectations? That's dopamine",
      "You're naturally motivated by freedom and autonomy"
    ],
    "blended_descriptions": [
      "Your birth date shows someone fiercely independent and self-directed. High dopamine gives you the drive to pursue what you want without apology, while your serotonin provides the emotional intelligence to know when to actually let someone in.",
      "What's powerful about your profile is how you balance independence with connection. Your dopamine fuels your need for freedom and autonomy, but your serotonin ensures you're not just protecting yourself but capable of deep, meaningful connection when you choose.",
      "You're wired for independence - that's undeniable. Your dopamine gives you the drive and courage to go after what you want, while your serotonin provides the intuition to know which connections are actually worth your energy.",
      "There's a huntress energy to your chemistry - you know what you want and you go after it. Your high dopamine makes you naturally independent and driven, but your serotonin ensures you're not just chasing freedom but capable of genuine loyalty when it matters."
    ]
  }
}